In [1]:
import numpy as np
import pandas as pd

# Reading and writing text files

In [2]:
# This is how to read a text file as dataframe in Python
df = pd.read_csv('/content/sample_data/sample.txt', header=None)

# When the header is provided as None, there would be no column names
df

       0   1   2
0    man  24  56
1  woman  34  89
2    man  78  60
3    man  89  58
4    man  27  90
5  woman  22  54

In [3]:
# Reading using read_table
df = pd.read_table('/content/sample_data/sample.txt', sep=',', header=None)
df

       0   1   2
0    man  24  56
1  woman  34  89
2    man  78  60
3    man  89  58
4    man  27  90
5  woman  22  54

In [4]:
# Reading only a few number of rows
df = pd.read_csv('/content/sample_data/sample.txt', header=None, nrows=3)
df

       0   1   2
0    man  24  56
1  woman  34  89
2    man  78  60

In [7]:
import sys

# Writing dataframe back into a csv file
df.to_csv(sys.stdout, header=None)

0,man,24,56
1,woman,34,89
2,man,78,60